КАКерамика_моя_старая_база/src/DataProcessors/ЖурналДокументовВнутреннегоТовародвижения/ЖурналДокументовВнутреннегоТовародвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЖурналДокументовВнутреннегоТовародвижения</name>
</mdclass:DataProcessor>

КАКерамика_моя_старая_база/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеестрДокументов</name>
  <resources>
    <name>НомерДокументаИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремещенийТоваров</types>
      <types>EnumRef.СтатусыАктаОРасхождениях</types>
      <types>EnumRef.СтатусыСборокТоваров</types>
      <types>EnumRef.СтатусыПередачМатериаловВПроизводство</types>
      <types>EnumRef.СтатусыЗаявокНаВозвратТоваровОтКлиентов</types>
      <types>EnumRef.СтатусыАвансовогоОтчета</types>
      <types>EnumRef.СтатусыОтраженияДокументовВРеглУчете</types>
      <types>EnumRef.СтатусыТаможенныхДеклараций</types>
      <types>EnumRef.СтатусыЗаказовКлиентов</types>
      <types>EnumRef.СтатусыЗаказовНаРемонт</types>
      <types>EnumRef.СтатусыДвиженияПродукцииИМатериалов</types>
      <types>EnumRef.СтатусыВозвратовМатериаловИзПроизводства</types>
      <types>EnumRef.СтатусыЗаказовПоставщикам</types>
      <types>EnumRef.СтатусыЗаказовМатериаловВПроизводство</types>
      <types>EnumRef.СтатусыРеализацийТоваровУслуг</types>
      <types>EnumRef.СтатусыВнутреннихЗаказов</types>
      <types>EnumRef.СтатусыЗаказовПереработчикам</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыЛизинга</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипСсылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.КлючиРеестраДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КлючиРеестраДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение, оформившее документ</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.АктОРасхожденияхПослеПеремещения</types>
      <types>DocumentRef.ПеремещениеВЭксплуатации</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АктОРасхожденияхПослеОтгрузки</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПереоценкаНМА2_4</types>
      <types>DocumentRef.ПередачаОСАрендатору</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.СчетФактураПолученныйАванс</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ПриобретениеУслугПоЛизингу</types>
      <types>DocumentRef.ИнойДокументПодтвержденияНДС</types>
      <types>DocumentRef.РегистрацияЗемельныхУчастков</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.АмортизацияНМА</types>
      <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.ОтгрузкаТоваровСХранения</types>
      <types>DocumentRef.ИзменениеПараметровОС2_4</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.АктОРасхожденияхПослеПриемки</types>
      <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
      <types>DocumentRef.НаработкаТМЦВЭксплуатации</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ВозвратОСОтАрендатора2_4</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
      <types>DocumentRef.ВыработкаСотрудников</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ИнвентаризационнаяОпись</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.СводнаяСправкаНДС</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.РазукомплектацияОС</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.МодернизацияОС2_4</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПодготовкаКПередачеОС2_4</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ИзменениеПараметровНМА</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ПереоценкаОС2_4</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.АмортизацияОС</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.НаработкаОбъектовЭксплуатации</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.ТаможеннаяДекларацияЭкспорт</types>
      <types>DocumentRef.ПоступлениеАрендованныхОС</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ПереоценкаНМА</types>
      <types>DocumentRef.ПередачаСырьяПереработчику</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ИзменениеСпособаОтраженияИмущественныхНалогов</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПереоценкаОС</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.ВыработкаНМА</types>
      <types>DocumentRef.АмортизацияНМА2_4</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ИзменениеСостоянияОС</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
      <types>DocumentRef.ИзменениеПараметровОС</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
      <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
      <types>DocumentRef.ОтменаРегистрацииТранспортныхСредств</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СписаниеПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество</types>
      <types>DocumentRef.СписаниеТоваровУХранителя</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</types>
      <types>DocumentRef.АмортизацияОС2_4</types>
      <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
      <types>DocumentRef.ВозвратОСОтАрендатора</types>
      <types>DocumentRef.ИнвентаризацияОС</types>
      <types>DocumentRef.ОтменаРегистрацииЗемельныхУчастков</types>
      <types>DocumentRef.СписаниеИзЭксплуатации</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупТоваровХранителем</types>
      <types>DocumentRef.ПередачаОСАрендатору2_4</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
      <types>DocumentRef.ИнвентаризацияНМА</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ВыбытиеАрендованныхОС</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.ПоступлениеПредметовЛизинга</types>
      <types>DocumentRef.РегистрацияТранспортныхСредств</types>
      <types>DocumentRef.СчетФактураКомитента</types>
      <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделительЗаписи</name>
    <comment>Служебное измерение, предназначенное для укрупнения порции записи данных в регистр</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/DataProcessors/ЖурналДокументовВнутреннегоТовародвижения/Forms/СписокДокументовКОформлению/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если ПустаяСтрока(Параметры.КлючНазначенияФормы) Тогда
		КлючНазначенияИспользования = КлючНазначенияФормыПоУмолчанию();
	Иначе
		КлючНазначенияИспользования = Параметры.КлючНазначенияФормы;
	КонецЕсли;
	
	Если КлючНазначенияИспользования = КлючНазначенияФормыПоУмолчанию() Тогда
		КлючНастроек = "";
	Иначе
		КлючНастроек = КлючНазначенияИспользования;
	КонецЕсли;
	
	Если Параметры.Свойство("Распоряжения") Тогда
		Распоряжения.ЗагрузитьЗначения(Параметры.Распоряжения);
	КонецЕсли;
	
	ВосстановитьНастройки(Параметры);
	УстановитьОтборПоОрганизации();
	
	ТЗХозОперацииИТипыДокументов = ОбщегоНазначенияУТ.ДоступныеХозяйственныеОперацииИДокументы(
		Обработки.ЖурналДокументовВнутреннегоТовародвижения.ОписаниеОперацийИТиповДокументов(
			ХозяйственныеОперацииИДокументы.Выгрузить(Новый Массив)).Скопировать(
				Новый Структура("МенеджерРасчетаГиперссылкиКОформлению", "Обработка.ЖурналДокументовВнутреннегоТовародвижения")),
		ОтборХозяйственныеОперации, ОтборТипыДокументов, КлючНастроек);
	
	ХозяйственныеОперацииИДокументы.Загрузить(ТЗХозОперацииИТипыДокументов);
	
	ЗаполнитьСписокВыбораМенеджера();
	НастроитьФормуПоПравамИФункциональнымОпциям();
	
	НастроитьФормуПоВыбраннымОперациямИДокументам(ТЗХозОперацииИТипыДокументов);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	СостояниеДокументовПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И КлючНазначенияИспользования <> "ТекущиеДела" И КлючНазначенияИспользования <> "ВводНаОсновании" Тогда
		СохранитьНастройки();
	КонецЕсли;
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "Запись_ЗаказНаВнутреннееПотребление"
		Или ИмяСобытия = "Запись_ЗаказНаПеремещение"
		Или ИмяСобытия = "Запись_ЗаказНаСборку"
		Или ИмяСобытия = "Запись_ВнутреннееПотреблениеТоваров"
		Или ИмяСобытия = "Запись_ПеремещениеТоваров"
		Или ИмяСобытия = "Запись_СборкаТоваров"
		Или ИмяСобытия = "Запись_ПрочееОприходованиеТоваров"
		Или ИмяСобытия = "Запись_ПрочееОприходованиеТоваров"
		//++ НЕ УТ
		Или ИмяСобытия = "Запись_ЗаказМатериаловВПроизводство"
		Или ИмяСобытия = "Запись_ПередачаМатериаловВПроизводство" 
		Или ИмяСобытия = "Запись_ДвижениеПродукцииИМатериалов"
		//-- НЕ УТ
		Или ИмяСобытия = "Запись_РасходныйОрдерНаТовары"
		Или ИмяСобытия = "Запись_ПриходныйОрдерНаТовары"
		Или ИмяСобытия = "Принять_ФормаСозданныхДокументов" Тогда
		
		ОбновитьСписокРаспоряженияНаОформлениеНаСервере();
		
		Если ЗначениеЗаполнено(Распоряжения) И СписокРаспоряженияНаОформление.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументовКОформлению.Элемент.Организация.ПриИзменении");
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	МенеджерПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеДокументовПриИзменении(Элемент)
	
	ОтборСтрок = Новый Структура;
	
	Если Не ПустаяСтрока(СостояниеНакладной) Тогда
		ОтборСтрок.Вставить("СостояниеНакладной", Число(СостояниеНакладной));
	КонецЕсли;
	Если Не ПустаяСтрока(СостояниеОрдераНаОтгрузку) Тогда
		ОтборСтрок.Вставить("СостояниеОрдераНаОтгрузку", Число(СостояниеОрдераНаОтгрузку));
	КонецЕсли;
	Если Не ПустаяСтрока(СостояниеОрдераНаПриемку) Тогда
		ОтборСтрок.Вставить("СостояниеОрдераНаПриемку", Число(СостояниеОрдераНаПриемку));
	КонецЕсли;
	
	Элементы.СписокРаспоряженияНаОформление.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационнаяНадписьОтборОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДоступныеХозяйственныеОперацииИДокументы", ПоместитьВоВременноеХранилищеХозяйственныеОперацииИДокументы());
	ПараметрыФормы.Вставить("КлючНастроек", КлючНазначенияИспользования);
	ПараметрыФормы.Вставить("КлючФормы", КлючНазначенияФормыПоУмолчанию());
	
	ОткрытьФорму("Справочник.НастройкиХозяйственныхОпераций.Форма.ФормаУстановкиОтбора",
		ПараметрыФормы,,,,,
		Новый ОписаниеОповещения("УстановитьОтборыПоХозОперациямИДокументам", 
		ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыПоХозОперациямИДокументам(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		
		АдресДоступныхХозяйственныхОперацийИДокументов = ВыбранноеЗначение;
		
		ОтборОперацияТипОбработкаВыбораСервер(АдресДоступныхХозяйственныхОперацийИДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаВнутренниеДокументыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияУТКлиент.ОткрытьЖурнал(ПараметрыЖурнала());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОформитьПоЗаказам(Команда)
	
	Перем СписокОшибок;
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументовКОформлению.Команда.ОформитьПоЗаказам");
	
	ВыделенныеСтроки = Элементы.СписокРаспоряженияНаОформление.ВыделенныеСтроки;
	Если Не ОбщегоНазначенияУТКлиент.ВыбраныДокументыКОформлению(
		ВыделенныеСтроки, ПараметрыЖурнала()) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ГруппировкиРаспоряжений = НакладныеКлиент.ДанныеДляОформленияПоЗаказам(СписокРаспоряженияНаОформление,
		ВыделенныеСтроки, "ХозяйственнаяОперация,Склад,Отправитель,Получатель",
		СписокОшибок, "Объект.СписокРаспоряженияНаОформление", ХозяйственныеОперацииИДокументы);
	
	Если ЗначениеЗаполнено(ГруппировкиРаспоряжений) Тогда
		
		ПараметрыСозданныхДокументов = НакладныеВызовСервера.ОформитьНакладныеПоЗаказам(ГруппировкиРаспоряжений,
			ПараметрыФормыСозданныхДокументов(), СписокОшибок, "Объект.СписокРаспоряженияНаОформление");
		НакладныеКлиент.ОткрытьФормуСозданныхДокументов(ПараметрыСозданныхДокументов, ЭтаФорма);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПоОтгрузкеПриемке(Команда)
	
	Перем СписокОшибок;
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументовКОформлению.Команда.ОформитьПоОтгрузкеПриемке");
	
	ВыделенныеСтроки = Элементы.СписокРаспоряженияНаОформление.ВыделенныеСтроки;
	Если Не ОбщегоНазначенияУТКлиент.ВыбраныДокументыКОформлению(
		ВыделенныеСтроки, ПараметрыЖурнала()) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ГруппировкиРаспоряжений = НакладныеКлиент.ДанныеДляОформленияПоОрдерам(СписокРаспоряженияНаОформление,
		ВыделенныеСтроки, "ХозяйственнаяОперация,Склад,Отправитель,Получатель",
		СписокОшибок, "Объект.СписокРаспоряженияНаОформление", ХозяйственныеОперацииИДокументы);
	
	Если ЗначениеЗаполнено(ГруппировкиРаспоряжений) Тогда
		
		ПараметрыСозданныхДокументов = НакладныеВызовСервера.ОформитьНакладныеПоОрдерам(ГруппировкиРаспоряжений,
			ПараметрыФормыСозданныхДокументов(), СписокОшибок, "Объект.СписокРаспоряженияНаОформление");
		НакладныеКлиент.ОткрытьФормуСозданныхДокументов(ПараметрыСозданныхДокументов, ЭтаФорма);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьАктОРасхождениях(Команда)
	
	Перем СписокОшибок;
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументовКОформлению.Команда.ОформитьАктОРасхождениях");
	
	ВыделенныеСтроки = Элементы.СписокРаспоряженияНаОформление.ВыделенныеСтроки;
	Если Не ОбщегоНазначенияУТКлиент.ВыбраныДокументыКОформлению(
		ВыделенныеСтроки, ПараметрыЖурнала()) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Заказы = Новый Массив;
	Накладные = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		
		Строка = СписокРаспоряженияНаОформление.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТекстОшибки = "";
		
		Если ТипЗнч(Строка.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			Если Строка.СостояниеНакладной = 1 Тогда
				ТекстОшибки = НСтр("ru = 'Для распоряжения %1 невозможно оформить акт о расхождениях, т.к. нет ни одной накладной.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, Строка.Ссылка);
			Иначе
				Заказы.Добавить(Строка.Ссылка);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Строка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Накладные.Добавить(Строка.Ссылка);
		Иначе
			ТекстОшибки = НСтр("ru = 'Для распоряжения %1 невозможно оформить акт о расхождениях, т.к. оно не является перемещением товаров.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Строка.Ссылка);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок, "Объект.СписокРаспоряженияНаОформление", ТекстОшибки, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Накладные) Или ЗначениеЗаполнено(Заказы) Тогда
		
		ПараметрыСозданныхДокументов = ОформитьАктОРасхожденияхНаСервере(Накладные, Заказы,
			ПараметрыФормыСозданныхДокументов(Истина), СписокОшибок, "Объект.СписокРаспоряженияНаОформление");
		НакладныеКлиент.ОткрытьФормуСозданныхДокументов(ПараметрыСозданныхДокументов, ЭтаФорма);
		
	ИначеЕсли Элементы.СписокРаспоряженияНаОформление.ВыделенныеСтроки.Количество() > 1 Тогда
		
		ТекстОшибки = НСтр("ru = 'Не выбрано ни одного документа, для которого можно было бы оформить акт о расхождениях.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок, "Объект.СписокРаспоряженияНаОформление", ТекстОшибки, Неопределено);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументовКОформлению.Команда.Обновить");
	
	ОбновитьСписокРаспоряженияНаОформлениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВыполнения(Команда)
	
	Если Элементы.СписокРаспоряженияНаОформление.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выделено ни одной строки. Выполнение команды невозможно.'"));
	Иначе
		СписокДокументов = Новый СписокЗначений;
		Для каждого Идентификатор Из Элементы.СписокРаспоряженияНаОформление.ВыделенныеСтроки Цикл
			СтрокаТаблицы = СписокРаспоряженияНаОформление.НайтиПоИдентификатору(Идентификатор);
			Если ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление")
				ИЛИ ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров")
				//++ НЕ УТ
				ИЛИ ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.ЗаказМатериаловВПроизводство")
				//-- НЕ УТ
				ИЛИ ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.ЗаказНаПеремещение")
				ИЛИ ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров")
				ИЛИ ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.ЗаказНаСборку")
				ИЛИ ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.СборкаТоваров") Тогда
				СписокДокументов.Добавить(СтрокаТаблицы.Ссылка);
			КонецЕсли;
		КонецЦикла;
		
		Если СписокДокументов.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Для выбранных документов отчет не поддерживается. Выполнение команды невозможно.'"));
			Возврат;
		КонецЕсли;
		
		ОткрытьФорму("Отчет.СостояниеВыполненияДокументов.Форма.ФормаОтчета",
			Новый Структура("ВходящиеДокументы", СписокДокументов));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкаФормы

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "СписокРаспоряженияНаОформление.Дата", "СписокРаспоряженияНаОформлениеДата");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоПравамИФункциональнымОпциям()
	
	Элементы.СписокРаспоряженияНаОформлениеСостояниеВыполнения.Видимость = ПравоДоступа("Просмотр", Метаданные.Отчеты.СостояниеВыполненияДокументов);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОрдернуюСхемуПриОтгрузке")
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ТоварыКОтгрузке) Тогда
		Элементы.СостояниеОрдераНаОтгрузку.Видимость = Ложь;
		Элементы.СписокРаспоряженияНаОформлениеСостояниеРасходногоОрдера.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОрдернуюСхемуПриПоступлении")
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ТоварыКПоступлению) Тогда
		Элементы.СостояниеОрдераНаПриемку.Видимость = Ложь;
		Элементы.СписокРаспоряженияНаОформлениеСостояниеПриходногоОрдера.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.СостояниеОрдераНаОтгрузку.Видимость ИЛИ Элементы.СостояниеОрдераНаПриемку.Видимость Тогда
		НакладныеСервер.ЗаполнитьСостоянияНакладной(Элементы.СостояниеНакладной.СписокВыбора);
		НакладныеСервер.ЗаполнитьСостоянияОрдера(Элементы.СостояниеОрдераНаОтгрузку.СписокВыбора);
		НакладныеСервер.ЗаполнитьСостоянияОрдера(Элементы.СостояниеОрдераНаПриемку.СписокВыбора);
		
		ДоступностьАктовОРасхождениях = ПолучитьФункциональнуюОпцию("ИспользоватьАктыРасхожденийПослеПеремещения")
			И ПравоДоступа("Добавление", Метаданные.Документы.АктОРасхожденияхПослеПеремещения);
	Иначе
		НакладныеСервер.ЗаполнитьСостоянияНакладной(Элементы.СостояниеНакладной.СписокВыбора, Истина);
		
		Элементы.СписокРаспоряженияНаОформлениеОформитьПоОтгрузкеПриемке.Видимость = Ложь;
		ДоступностьАктовОРасхождениях = Ложь;
		
		Элементы.СписокРаспоряженияНаОформлениеОформитьПоЗаказам.Заголовок = НСтр("ru = 'Оформить'");
		Элементы.Переместить(Элементы.ГруппаКомандыДокументов, Элементы.ГруппаСостоянияДокументов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Распоряжения) Тогда
		Элементы.ГруппаОтборы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ЕстьПраваНаСоздание = ХозяйственныеОперацииИДокументы.НайтиСтроки(Новый Структура("Отбор, ПравоДоступаДобавление", Истина, Истина)).Количество() > 0;
	
	Элементы.СписокРаспоряженияНаОформлениеОформитьПоЗаказам.Доступность = ЕстьПраваНаСоздание;
	Элементы.СписокРаспоряженияНаОформлениеОформитьПоОтгрузкеПриемке.Доступность = ЕстьПраваНаСоздание;
	
	Элементы.СписокРаспоряженияНаОформлениеОформитьАктОРасхождениях.Видимость = ДоступностьАктовОРасхождениях
		И ХозяйственныеОперацииИДокументы.НайтиСтроки(Новый Структура("Отбор, ТипДокумента", Истина, Тип("ДокументСсылка.ПеремещениеТоваров"))).Количество() > 0;
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораМенеджера()
	
	Элементы.Менеджер.СписокВыбора.Очистить();
	ИменаДокументов = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ХозяйственныеОперацииИДокументы.Выгрузить(),"ПолноеИмяДокумента");
	МассивРолей = Новый Массив;
	Для Каждого Стр Из ИменаДокументов Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРолей, ПраваПользователяПовтИсп.ИменаРолейСПравомДобавления(Стр));
	КонецЦикла;
	ОтчетыКлиентСервер.ДополнитьСписок(Элементы.Менеджер.СписокВыбора, ОбщегоНазначенияУТ.ПользователиСДоступнымиРолями(МассивРолей));
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	ШтрихкодированиеПечатныхФормВызовСервера.СсылкаНаЭлементСпискаПоШтрихкоду(
		Штрихкод, ХозяйственныеОперацииИДокументы.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		
		Ссылка = МассивСсылок[0];
		
		Найдено = СписокРаспоряженияНаОформление.НайтиСтроки(Новый Структура("Ссылка", Ссылка));
		Если ЗначениеЗаполнено(Найдено) Тогда
			Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
		КонецЕсли;
		ПоказатьЗначение(Неопределено, Ссылка);
		
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОтборОперацияТипОбработкаВыбораСервер(АдресХозяйственныхОперацийИДокументов)
	
	ТЗХозОперацииИТипыДокументов = ПолучитьИзВременногоХранилища(АдресХозяйственныхОперацийИДокументов);
	ХозяйственныеОперацииИДокументы.Загрузить(ТЗХозОперацииИТипыДокументов);
	ОбщегоНазначенияУТ.ЗаполнитьОтборыПоТаблицеХозОперацийИТиповДокументов(ТЗХозОперацииИТипыДокументов, ОтборХозяйственныеОперации, ОтборТипыДокументов);
	
	НастроитьФормуПоВыбраннымОперациямИДокументам(ТЗХозОперацииИТипыДокументов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючНазначенияФормыПоУмолчанию()
	
	Возврат "ВнутреннееТовародвижение";
	
КонецФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеХозяйственныеОперацииИДокументы()
	Возврат ПоместитьВоВременноеХранилище(ХозяйственныеОперацииИДокументы.Выгрузить(), УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Функция ПараметрыЖурнала()
	
	СтруктураБыстрогоОтбора = Новый Структура;
	СтруктураБыстрогоОтбора.Вставить("Организация",	Организация);
	СтруктураБыстрогоОтбора.Вставить("Склад",		Склад);
	СтруктураБыстрогоОтбора.Вставить("Менеджер",	Менеджер);
	СтруктураБыстрогоОтбора.Вставить("ОтборТипыДокументов",			ОтборТипыДокументов);
	СтруктураБыстрогоОтбора.Вставить("ОтборХозяйственныеОперации",	ОтборХозяйственныеОперации);
	
	ПараметрыЖурнала = Новый Структура;
	ПараметрыЖурнала.Вставить("СтруктураБыстрогоОтбора",	СтруктураБыстрогоОтбора);
	ПараметрыЖурнала.Вставить("ИмяРабочегоМеста",			"ЖурналДокументовВнутреннегоТовародвижения");
	ПараметрыЖурнала.Вставить("КлючНазначенияФормы",		КлючНазначенияИспользования);
	ПараметрыЖурнала.Вставить("СинонимЖурнала",				НСтр("ru = 'Внутренние документы'"));
	
	Возврат ПараметрыЖурнала;
	
КонецФункции

Процедура НастроитьФормуПоВыбраннымОперациямИДокументам(ТЗХозОперацииИТипыДокументов)
	
	ЗаголовокПоУмолчанию = НСтр("ru = 'Внутренние документы (к оформлению)'");
	ДанныеРабочегоМеста = ОбщегоНазначенияУТ.ДанныеРабочегоМеста(ТЗХозОперацииИТипыДокументов,
		КлючНазначенияФормыПоУмолчанию(), ЗаголовокПоУмолчанию);
	
	Заголовок = ДанныеРабочегоМеста.ЗаголовокРабочегоМеста;
	Если Заголовок <> ЗаголовокПоУмолчанию Тогда
		Заголовок = Заголовок + " " + НСтр("ru = '(к оформлению)'");
	КонецЕсли;
	
	СформироватьТекстыЗапросов();
	ОбновитьСписокРаспоряженияНаОформлениеНаСервере();
	
	УстановитьВидимостьДоступность();
	
	ОбщегоНазначенияУТ.СформироватьНадписьОтбор(Элементы.ИнформационнаяНадписьОтбор.Заголовок,
		ХозяйственныеОперацииИДокументы, ОтборТипыДокументов, ОтборХозяйственныеОперации);
	
КонецПроцедуры

#Область СохраняемыеНастройкиФормы

&НаСервере
Процедура ВосстановитьНастройки(Параметры)
	
	Если Параметры.Свойство("СтруктураБыстрогоОтбора") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиФормы(Параметры.СтруктураБыстрогоОтбора));
	Иначе
		НастройкиИзХранилища = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументовКОформлению", КлючНазначенияИспользования);
	
		Если ТипЗнч(НастройкиИзХранилища) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиФормы(НастройкиИзХранилища));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ЖурналДокументовВнутреннегоТовародвижения.Форма.СписокДокументовКОформлению",
		КлючНазначенияИспользования, НастройкиФормы(ЭтаФорма));
	
КонецПроцедуры

&НаСервере
Функция НастройкиФормы(ИсточникНастроек)
	
	ИменаСохраняемыхРеквизитов =
		"Организация,
		|Склад,
		|Менеджер,
		|СостояниеНакладной,
		|СостояниеОрдераНаОтгрузку,
		|СостояниеОрдераНаПриемку,
		|ОтборХозяйственныеОперации,
		|ОтборТипыДокументов";
	
	Настройки = Новый Структура(ИменаСохраняемыхРеквизитов);
	ЗаполнитьЗначенияСвойств(Настройки, ИсточникНастроек);
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ОбновитьСписокРаспоряженияНаОформлениеНаСервере()
	
	Если Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока <> Неопределено Тогда
		ТекущийДокумент = СписокРаспоряженияНаОформление.НайтиПоИдентификатору(Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока).Ссылка;
	Иначе
		ТекущийДокумент = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаРасчетаСостояний);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТипыЗаказов = Новый Массив;
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление"));
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЗаказНаСборку"));
	//++ НЕ УТ
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЗаказМатериаловВПроизводство"));
	//-- НЕ УТ
	
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация",       СписокОрганизаций.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Склад",             Склад);
	Запрос.УстановитьПараметр("Менеджер",          Менеджер);
	Запрос.УстановитьПараметр("ХозОперация",       ОтборХозяйственныеОперации.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ТипыЗаказов",       ТипыЗаказов);
	Запрос.УстановитьПараметр("Распоряжения",      Распоряжения.ВыгрузитьЗначения());
	
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаСпискаРаспоряжений;
	
	УстановитьПривилегированныйРежим(Истина);
	СписокРаспоряженияНаОформление.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТекущийДокумент <> Неопределено Тогда
		Найдено = СписокРаспоряженияНаОформление.НайтиСтроки(Новый Структура("Ссылка", ТекущийДокумент));
		Если ЗначениеЗаполнено(Найдено) Тогда
			Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьОтборПоОрганизации();
	
	СформироватьТекстыЗапросов();
	ОбновитьСписокРаспоряженияНаОформлениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоОрганизации()

	СписокОрганизаций.Очистить();
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокОрганизаций.ЗагрузитьЗначения(Справочники.Организации.ФилиалыСРасчетамиЧерезГоловнуюОрганизацию(Организация));
		СписокОрганизаций.Добавить(Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	
	СформироватьТекстыЗапросов();
	ОбновитьСписокРаспоряженияНаОформлениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура МенеджерПриИзмененииНаСервере()
	
	СформироватьТекстыЗапросов();
	ОбновитьСписокРаспоряженияНаОформлениеНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОформитьАктОРасхожденияхНаСервере(Накладные, Заказы, ПараметрыФормыСозданныхДокументов, СписокОшибок, ПолеОшибки)
	
	ПараметрыСозданныхДокументов = Новый Структура("ИмяФормы, Параметры");
	
	Если ЗначениеЗаполнено(Заказы) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПеремещениеТоваров.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
			|ГДЕ
			|	ПеремещениеТоваров.ЗаказНаПеремещение В(&ЗаказыНаПеремещение)
			|	И ПеремещениеТоваров.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("ЗаказыНаПеремещение", Заказы);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Накладные, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	КонецЕсли;
	
	НакладныеСервер.СгруппироватьДокументыПоКлючевымПолям(Накладные, Документы.АктОРасхожденияхПослеПеремещения.КлючевыеПоляШапкиРаспоряжения());
	
	Если Накладные.Количество() = 1 Тогда
		
		МенеджерНакладной = Документы.АктОРасхожденияхПослеПеремещения;
		
		ПараметрыЗаполнения = МенеджерНакладной.ПараметрыЗаполненияДокумента();
		РеквизитыШапки = МенеджерНакладной.ДанныеЗаполненияНакладной(Накладные[0]);
		МенеджерНакладной.ИнициализироватьПараметрыЗаполнения(ПараметрыЗаполнения, РеквизитыШапки, Накладные[0]);
		
		ПараметрыСозданныхДокументов.ИмяФормы = "Документ.АктОРасхожденияхПослеПеремещения.ФормаОбъекта";
		ПараметрыСозданныхДокументов.Параметры = Новый Структура("Основание", ПараметрыЗаполнения);
		
	Иначе
		
		Группировка = Новый Структура("ИмяОформляемогоДокумента, МассивЗаказов, ПоляЗаполнения",
			Метаданные.Документы.АктОРасхожденияхПослеПеремещения.Имя, Накладные, Новый Структура);
		
		ГруппировкиРаспоряжений = Новый Массив(1);
		ГруппировкиРаспоряжений[0] = Группировка;
		
		СозданныеДокументы = НакладныеСервер.СформироватьДокументыПоРаспоряжениям(ГруппировкиРаспоряжений, СписокОшибок, ПолеОшибки);
		
		Если Не ЗначениеЗаполнено(СозданныеДокументы) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Владелец = Пользователи.АвторизованныйПользователь();
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, СозданныеДокументы, ПараметрыФормыСозданныхДокументов.КлючДанных);
		УстановитьПривилегированныйРежим(Ложь);
		
		ПараметрыСозданныхДокументов.ИмяФормы = "ОбщаяФорма.ФормаСозданныхДокументов";
		ПараметрыСозданныхДокументов.Параметры = ПараметрыФормыСозданныхДокументов;
		ПараметрыСозданныхДокументов.Вставить("КоличествоСозданныхДокументов", СозданныеДокументы.Количество());
		
	КонецЕсли;
	
	Возврат ПараметрыСозданныхДокументов;
	
КонецФункции

&НаСервере
Процедура СформироватьТекстыЗапросов()
	
	ПараметрыОтбора = НакладныеСервер.ПараметрыОтбораРаспоряжений(Организация,, Склад, ОтборХозяйственныеОперации, Менеджер);
	
	Пакет = Новый Массив;
	Выборка = Новый Массив;
	Состояния = НакладныеСервер.СостоянияПоХозоперациям(ОтборХозяйственныеОперации.ВыгрузитьЗначения());
	Для каждого КЗ Из Состояния Цикл
		Пакет.Добавить(НакладныеСервер.ТекстЗапросаСостояний(КЗ.Ключ, ПараметрыОтбора, КЗ.Значение));
		
		Если КЗ.Ключ = "СостоянияРасходныхОрдеров" Тогда
			Выборка.Добавить(
			"ВЫБРАТЬ
			|	СостоянияРасходныхОрдеров.Распоряжение КАК Распоряжение,
			|	СостоянияРасходныхОрдеров.Склад КАК Склад,
			|	СостоянияРасходныхОрдеров.Склад КАК Отправитель,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) = ТИП(Документ.ЗаказНаВнутреннееПотребление)
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ СостоянияРасходныхОрдеров.Получатель
			|	КОНЕЦ КАК Получатель,
			|	ВЫБОР
			|		КОГДА ИСТИНА
			|			ТОГДА NULL
			|	КОНЕЦ КАК ХозОперация,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
			|			ТОГДА 0
			|		ИНАЧЕ 4
			|	КОНЕЦ КАК СостояниеНакладной,
			|	СостоянияРасходныхОрдеров.Состояние КАК СостояниеРасходногоОрдера,
			|	ВЫБОР
			|		КОГДА СпрСкладыПолучатель.Ссылка ЕСТЬ NULL
			|				ИЛИ ВЫБОР
			|					КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
			|						ТОГДА ВЫРАЗИТЬ(СостоянияРасходныхОрдеров.Распоряжение КАК Документ.ЗаказНаПеремещение).ВариантПриемкиТоваров
			|					КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) = ТИП(Документ.ЗаказНаСборку)
			|						ТОГДА ВЫРАЗИТЬ(СостоянияРасходныхОрдеров.Распоряжение КАК Документ.ЗаказНаСборку).ВариантПриемкиТоваров
			|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным)
			|			ТОГДА 4
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеПриходногоОрдера,
			|	ИСТИНА КАК НакладнаяНаОтгрузку,
			|	ЛОЖЬ КАК НакладнаяНаПриемку
			|ИЗ
			|	ВТСостоянияРасходныхОрдеров КАК СостоянияРасходныхОрдеров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыПолучатель
			|		ПО (СпрСкладыПолучатель.Ссылка = СостоянияРасходныхОрдеров.Получатель)
			|			И (СпрСкладыПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении)
			|			И (СпрСкладыПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &НачалоТекущегоДня)");
		ИначеЕсли КЗ.Ключ = "СостоянияПриходныхОрдеров" Тогда
			Выборка.Добавить(
			"ВЫБРАТЬ
			|	СостоянияПриходныхОрдеров.Распоряжение КАК Распоряжение,
			|	СостоянияПриходныхОрдеров.Склад КАК Склад,
			|	ВЫБОР
			|		КОГДА СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.ПрочееОприходованиеТоваров
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ СостоянияПриходныхОрдеров.Отправитель
			|	КОНЕЦ КАК Отправитель,
			|	СостоянияПриходныхОрдеров.Склад КАК Получатель,
			|	ВЫБОР
			|		КОГДА ИСТИНА
			|			ТОГДА NULL
			|	КОНЕЦ КАК ХозОперация,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияПриходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
			|			ТОГДА 0
			|		ИНАЧЕ 4
			|	КОНЕЦ КАК СостояниеНакладной,
			|	ВЫБОР
			|		КОГДА СпрСкладыОправитель.Ссылка ЕСТЬ NULL
			|				ИЛИ ВЫБОР
			|					КОГДА СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.СборкаТоваров
			|						ТОГДА ВЫБОР
			|								КОГДА ВЫРАЗИТЬ(СостоянияПриходныхОрдеров.Распоряжение КАК Документ.СборкаТоваров).ЗаказНаСборку = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
			|									ТОГДА НЕОПРЕДЕЛЕНО
			|								ИНАЧЕ ВЫРАЗИТЬ(СостоянияПриходныхОрдеров.Распоряжение КАК Документ.СборкаТоваров).ВариантПриемкиТоваров
			|							КОНЕЦ
			//++ НЕ УТ
			|					КОГДА СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
			|						ТОГДА ВЫРАЗИТЬ(СостоянияПриходныхОрдеров.Распоряжение КАК Документ.ДвижениеПродукцииИМатериалов).ВариантПриемкиТоваров
			//-- НЕ УТ
			|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным)
			|			ТОГДА 4
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеРасходногоОрдера,
			|	СостоянияПриходныхОрдеров.Состояние КАК СостояниеПриходногоОрдера,
			|	ЛОЖЬ КАК НакладнаяНаОтгрузку,
			|	ИСТИНА КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияПриходныхОрдеров КАК СостоянияПриходныхОрдеров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОправитель
			|		ПО (СпрСкладыОправитель.Ссылка = СостоянияПриходныхОрдеров.Отправитель)
			|			И (СпрСкладыОправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
			|			И (СпрСкладыОправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)
			|ГДЕ
			|	НЕ СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.ЗаказНаПеремещение
			|	И НЕ СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СостоянияПриходныхОрдеров.Распоряжение,
			|	СостоянияПриходныхОрдеров.Отправитель,
			|	СостоянияПриходныхОрдеров.Отправитель,
			|	СостоянияПриходныхОрдеров.Склад,
			|	NULL,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияПриходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
			|			ТОГДА 0
			|		ИНАЧЕ 4
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА СпрСкладыОправитель.Ссылка ЕСТЬ NULL
			|				ИЛИ ВЫБОР
			|					КОГДА СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
			|						ТОГДА ВЫБОР
			|								КОГДА НЕ ВЫРАЗИТЬ(СостоянияПриходныхОрдеров.Распоряжение КАК Документ.ПеремещениеТоваров).ПеремещениеПоЗаказам
			|									ТОГДА НЕОПРЕДЕЛЕНО
			|								ИНАЧЕ ВЫРАЗИТЬ(СостоянияПриходныхОрдеров.Распоряжение КАК Документ.ПеремещениеТоваров).ВариантПриемкиТоваров
			|							КОНЕЦ
			|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным)
			|			ТОГДА 4
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	СостоянияПриходныхОрдеров.Состояние,
			|	ИСТИНА,
			|	ЛОЖЬ
			|ИЗ
			|	ВтСостоянияПриходныхОрдеров КАК СостоянияПриходныхОрдеров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОправитель
			|		ПО (СпрСкладыОправитель.Ссылка = СостоянияПриходныхОрдеров.Отправитель)
			|			И (СпрСкладыОправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
			|			И (СпрСкладыОправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)
			|ГДЕ
			|	(СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.ЗаказНаПеремещение
			|			ИЛИ СостоянияПриходныхОрдеров.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров)");
		ИначеЕсли КЗ.Ключ = "СостоянияПеремещений" Тогда
			Выборка.Добавить(
			"ВЫБРАТЬ
			|	СостоянияПеремещений.Распоряжение КАК Распоряжение,
			|	ДокЗаказНаПеремещение.СкладОтправитель КАК Склад,
			|	ДокЗаказНаПеремещение.СкладОтправитель КАК Отправитель,
			|	ДокЗаказНаПеремещение.СкладПолучатель КАК Получатель,
			|	NULL КАК ХозОперация,
			|	СостоянияПеремещений.Состояние КАК СостояниеНакладной,
			|	ВЫБОР
			|		КОГДА СпрСкладыОправитель.Ссылка ЕСТЬ NULL
			|			ТОГДА 4
			|		КОГДА СостоянияПеремещений.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеРасходногоОрдера,
			|	ВЫБОР
			|		КОГДА СпрСкладыПолучатель.Ссылка ЕСТЬ NULL
			|				ИЛИ ДокЗаказНаПеремещение.ВариантПриемкиТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным)
			|			ТОГДА 4
			|		КОГДА СостоянияПеремещений.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеПриходногоОрдера,
			|	ИСТИНА КАК НакладнаяНаОтгрузку,
			|	ЛОЖЬ КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияПеремещений КАК СостоянияПеремещений
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ДокЗаказНаПеремещение
			|		ПО СостоянияПеремещений.Распоряжение = ДокЗаказНаПеремещение.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОправитель
			|		ПО (СпрСкладыОправитель.Ссылка = ДокЗаказНаПеремещение.СкладОтправитель)
			|			И (СпрСкладыОправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
			|			И (СпрСкладыОправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыПолучатель
			|		ПО (СпрСкладыПолучатель.Ссылка = ДокЗаказНаПеремещение.СкладПолучатель)
			|			И (СпрСкладыПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении)
			|			И (СпрСкладыПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &НачалоТекущегоДня)");
		ИначеЕсли КЗ.Ключ = "СостоянияСборок" Тогда
			Выборка.Добавить(
			"ВЫБРАТЬ
			|	СостоянияСборок.Распоряжение КАК Распоряжение,
			|	ДокЗаказНаСборку.Склад КАК Склад,
			|	ДокЗаказНаСборку.Склад КАК Отправитель,
			|	ДокЗаказНаСборку.Склад КАК Получатель,
			|	NULL КАК ХозОперация,
			|	СостоянияСборок.Состояние КАК СостояниеНакладной,
			|	ВЫБОР
			|		КОГДА СпрСкладыОправитель.Ссылка ЕСТЬ NULL
			|			ТОГДА 4
			|		КОГДА СостоянияСборок.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеРасходногоОрдера,
			|	ВЫБОР
			|		КОГДА СпрСкладыПолучатель.Ссылка ЕСТЬ NULL
			|				ИЛИ ДокЗаказНаСборку.ВариантПриемкиТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным)
			|			ТОГДА 4
			|		КОГДА СостоянияСборок.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеПриходногоОрдера,
			|	ИСТИНА КАК НакладнаяНаОтгрузку,
			|	ИСТИНА КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияСборок КАК СостоянияСборок
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ДокЗаказНаСборку
			|		ПО СостоянияСборок.Распоряжение = ДокЗаказНаСборку.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОправитель
			|		ПО (СпрСкладыОправитель.Ссылка = ДокЗаказНаСборку.Склад)
			|			И (СпрСкладыОправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
			|			И (СпрСкладыОправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыПолучатель
			|		ПО (СпрСкладыПолучатель.Ссылка = ДокЗаказНаСборку.Склад)
			|			И (СпрСкладыПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении)
			|			И (СпрСкладыПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &НачалоТекущегоДня)");
		ИначеЕсли КЗ.Ключ = "СостоянияВнутреннихПотреблений" Тогда
			Выборка.Добавить(
			"ВЫБРАТЬ
			|	СостоянияВнутреннихПотреблений.Распоряжение КАК Распоряжение,
			|	СостоянияВнутреннихПотреблений.Склад КАК Склад,
			|	СостоянияВнутреннихПотреблений.Склад КАК Отправитель,
			|	НЕОПРЕДЕЛЕНО КАК Получатель,
			|	ВЫБОР
			|		КОГДА ИСТИНА
			|			ТОГДА NULL
			|	КОНЕЦ КАК ХозОперация,
			|	СостоянияВнутреннихПотреблений.Состояние КАК СостояниеНакладной,
			|	ВЫБОР
			|		КОГДА СпрСкладыОправитель.Ссылка ЕСТЬ NULL
			|			ТОГДА 4
			|		КОГДА СостоянияВнутреннихПотреблений.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеРасходногоОрдера,
			|	4 КАК СостояниеПриходногоОрдера,
			|	ИСТИНА КАК НакладнаяНаОтгрузку,
			|	ЛОЖЬ КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияВнутреннихПотреблений КАК СостоянияВнутреннихПотреблений
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОправитель
			|		ПО (СпрСкладыОправитель.Ссылка = СостоянияВнутреннихПотреблений.Склад)
			|			И (СпрСкладыОправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
			|			И (СпрСкладыОправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)");
		//++ НЕ УТ
		ИначеЕсли КЗ.Ключ = "СостоянияПередачВПроизводство" Тогда
			Выборка.Добавить(
			"ВЫБРАТЬ
			|	СостоянияПередачВПроизводство.Распоряжение КАК Распоряжение,
			|	СостоянияПередачВПроизводство.Склад КАК Склад,
			|	СостоянияПередачВПроизводство.Склад КАК Отправитель,
			|	СостоянияПередачВПроизводство.Получатель КАК Получатель,
			|	ВЫБОР
			|		КОГДА ИСТИНА
			|			ТОГДА NULL
			|	КОНЕЦ КАК ХозОперация,
			|	СостоянияПередачВПроизводство.Состояние КАК СостояниеНакладной,
			|	ВЫБОР
			|		КОГДА СпрСкладыОправитель.Ссылка ЕСТЬ NULL
			|			ТОГДА 4
			|		КОГДА СостоянияПередачВПроизводство.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеРасходногоОрдера,
			|	4 КАК СостояниеПриходногоОрдера,
			|	ИСТИНА КАК НакладнаяНаОтгрузку,
			|	ЛОЖЬ КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияПередачВПроизводство КАК СостоянияПередачВПроизводство
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОправитель
			|		ПО (СпрСкладыОправитель.Ссылка = СостоянияПередачВПроизводство.Склад)
			|			И (СпрСкладыОправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
			|			И (СпрСкладыОправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)");
		//-- НЕ УТ
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапросаРасчетаСостояний = СтрСоединить(Пакет, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	ТекстЗапросаСпискаРаспоряжений =
		СтрЗаменить(
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Распоряжение КАК Ссылка,
		|	ВложенныйЗапрос.Склад КАК Склад,
		|	ВложенныйЗапрос.Отправитель КАК Отправитель,
		|	ВложенныйЗапрос.Получатель КАК Получатель,
		|	ВложенныйЗапрос.ХозОперация КАК ХозОперация,
		|	МАКСИМУМ(ВложенныйЗапрос.СостояниеНакладной) КАК СостояниеНакладной,
		|	МАКСИМУМ(ВложенныйЗапрос.СостояниеРасходногоОрдера) КАК СостояниеОрдераНаОтгрузку,
		|	МАКСИМУМ(ВложенныйЗапрос.СостояниеПриходногоОрдера) КАК СостояниеОрдераНаПриемку,
		|	МАКСИМУМ(ВложенныйЗапрос.НакладнаяНаОтгрузку) КАК НакладнаяНаОтгрузку,
		|	МАКСИМУМ(ВложенныйЗапрос.НакладнаяНаПриемку) КАК НакладнаяНаПриемку
		|ПОМЕСТИТЬ ВтОстаткиСостояния
		|ИЗ
		|	ТекстЗапросаВложенный КАК ВложенныйЗапрос
		|//&КонтекстРаспоряжений
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Распоряжение,
		|	ВложенныйЗапрос.Склад,
		|	ВложенныйЗапрос.Отправитель,
		|	ВложенныйЗапрос.Получатель,
		|	ВложенныйЗапрос.ХозОперация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеестрДокументов.НомерДокументаИБ КАК Номер,
		|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата,
		|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК ТипРаспоряжения,
		|	ОстаткиСостояния.СостояниеНакладной КАК СостояниеНакладной,
		|	ОстаткиСостояния.СостояниеОрдераНаОтгрузку КАК СостояниеОрдераНаОтгрузку,
		|	ОстаткиСостояния.СостояниеОрдераНаПриемку КАК СостояниеОрдераНаПриемку,
		|	ОстаткиСостояния.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		|	ОстаткиСостояния.НакладнаяНаПриемку КАК НакладнаяНаПриемку,
		|	РеестрДокументов.Организация КАК Организация,
		|	РеестрДокументов.Подразделение КАК Подразделение,
		|	ОстаткиСостояния.Склад КАК Склад,
		|	ОстаткиСостояния.Отправитель КАК Отправитель,
		|	ОстаткиСостояния.Получатель КАК Получатель,
		|	РеестрДокументов.Ответственный КАК Менеджер,
		|	ЕСТЬNULL(ОстаткиСостояния.ХозОперация, РеестрДокументов.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
		|	ОстаткиСостояния.Ссылка КАК Ссылка,
		|	РеестрДокументов.Комментарий КАК Комментарий
		|ИЗ
		|	ВтОстаткиСостояния КАК ОстаткиСостояния
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|		ПО ОстаткиСостояния.Ссылка = РеестрДокументов.Ссылка
		|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
		|//&УсловиеНеобязательностиПриемки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата", "ТекстЗапросаВложенный", "(" + СтрСоединить(Выборка, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()) + ")");
	
	Если ЗначениеЗаполнено(Распоряжения) Тогда
		ТекстЗапросаСпискаРаспоряжений = СтрЗаменить(ТекстЗапросаСпискаРаспоряжений, "//&КонтекстРаспоряжений",
		"ГДЕ
		|	ВложенныйЗапрос.Распоряжение В (&Распоряжения)");
	КонецЕсли;
	
	Если Не ДоступностьАктовОРасхождениях Тогда
		ТекстЗапросаСпискаРаспоряжений = СтрЗаменить(ТекстЗапросаСпискаРаспоряжений, "//&УсловиеНеобязательностиПриемки",
		"ГДЕ
		|	(НЕ ОстаткиСостояния.Ссылка ССЫЛКА Документ.ЗаказНаПеремещение
		|			И НЕ ОстаткиСостояния.Ссылка ССЫЛКА Документ.ПеремещениеТоваров)
		|		ИЛИ (ОстаткиСостояния.СостояниеНакладной <> 0 И ОстаткиСостояния.СостояниеНакладной <> 4
		|				ИЛИ ОстаткиСостояния.СостояниеОрдераНаОтгрузку <> 0 И ОстаткиСостояния.СостояниеОрдераНаОтгрузку <> 4)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыСозданныхДокументов(ОформляетсяАктОРасхождении = Ложь)
	
	ПараметрыФормы = Новый Структура("КлючДанных, ВидимыеКолонки, СобытияОбновления",
		КлючНазначенияИспользования, Новый Массив, Новый Массив);
	
	ПараметрыФормы.ВидимыеКолонки.Добавить("Номер");
	ПараметрыФормы.ВидимыеКолонки.Добавить("Дата");
	ПараметрыФормы.ВидимыеКолонки.Добавить("ТипЗначения");
	ПараметрыФормы.ВидимыеКолонки.Добавить("ХозяйственнаяОперация");
	ПараметрыФормы.ВидимыеКолонки.Добавить("Организация");
	ПараметрыФормы.ВидимыеКолонки.Добавить("Склад");
	ПараметрыФормы.ВидимыеКолонки.Добавить("Подразделение");
	Если ОформляетсяАктОРасхождении
		Или ХозяйственныеОперацииИДокументы.НайтиСтроки(Новый Структура("Отбор, ИспользуютсяСтатусы", Истина, Истина)).Количество() <> 0 Тогда
		ПараметрыФормы.ВидимыеКолонки.Добавить("Статус");
	КонецЕсли;
	ПараметрыФормы.ВидимыеКолонки.Добавить("Дополнительно");
	
	ПараметрыФормы.СобытияОбновления.Добавить("Запись_АктОРасхожденияхПослеПеремещения");
	ПараметрыФормы.СобытияОбновления.Добавить("Запись_ВнутреннееПотреблениеТоваров");
	ПараметрыФормы.СобытияОбновления.Добавить("Запись_ПеремещениеТоваров");
	ПараметрыФормы.СобытияОбновления.Добавить("Запись_СборкаТоваров");
	//++ НЕ УТ
	ПараметрыФормы.СобытияОбновления.Добавить("Запись_ПередачаМатериаловВПроизводство");
	ПараметрыФормы.СобытияОбновления.Добавить("Запись_ДвижениеПродукцииИМатериалов");
	//-- НЕ УТ
	
	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти
